#+TITLE: Procedures and Process; The Substitution Model
#+AUTHOR: Fabricio Puente-Mansilla
#+DATE: <2026-05-09 Sat>
#+OPTIONS: toc:2
#+PROPERTY: header-args:elisp :results output :exports both

* Elisp Lab: Timing the Tree

You can use the ~benchmark~ tool in Emacs to see how the exponential
time complexity hits a "wall" as $n$ increases.

#+BEGIN_SRC elisp
  (defun fib (n)
    (cond ((= n 0) 0) ((= n 1) 1)
          (t (+ (fib (- n 1)) (fib (- n 2))))))

  (princ (format "Fib(10) time: %s\n" (benchmark-run 1 (fib 10))))
  (princ (format "Fib(20) time: %s\n" (benchmark-run 1 (fib 20))))
  ;; Be careful calling (fib 40) or higher, as it will take a long time!
#+END_SRC

#+RESULTS:
: Fib(10) time: (4.9962e-05 0 0.0)
: Fib(20) time: (0.005758976000000001 0 0.0)

* Elisp Lab: Running Hanoi

You can run a small version of the tower in your Emacs buffer to see
the moves printed out.

#+BEGIN_SRC elisp
  (defun move-tower (n from to extra)
    (unless (= n 0)
      (move-tower (1- n) from extra to)
      (princ (format "Move disk from %s to %s\n" from to))
      (move-tower (1- n) extra to from)))

  (move-tower 3 'A 'C 'B)
#+END_SRC

#+RESULTS:
: Move disk from A to C
: Move disk from A to B
: Move disk from C to B
: Move disk from A to C
: Move disk from B to A
: Move disk from B to C
: Move disk from A to C
